---
type: TableMergedCell
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# TableMergedCell

`Autodesk.Revit.DB.TableMergedCell` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TableMergedCell | — | `` |
| Constructor | TableMergedCell | 2011 | `public TableMergedCell ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Bottom | 2011 | `public int Bottom { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Left | 2011 | `public int Left { get ; set ; }` |
| Property | Right | 2011 | `public int Right { get ; set ; }` |
| Property | Top | 2011 | `public int Top { get ; set ; }` |